{
    "aranimal": {
        "title": "AR Animal Identification",
        "description": "This app is part of a project by Aquatic Biosphere, aimed at raising awareness and funds for the Albertan Biosphere. It pairs with a vinyl sticker showcasing local organisms. Users can identify and learn about these creatures through interactive games and activities. The app also features easy customization for admins to update information.",
        "images": ["aranimal1.jpg", "aranimal3.jpg", "aranimal4.jpg", "aranimal5.jpg", "aranimal6.jpg"],
        "videos": ["ARANIMAL.webm"],
        "technologies": {
            "Android Studio": "IDE for development.",
            "Figma": "Used for wireframing and storyboarding.",
            "Flutter": "For frontend development and connecting to the backend.",
            "FastAPI": "Creates API endpoints for image recognition and database interactions.",
            "PostgreSQL": "Data storage and management.",
            "OpenCV": "For image processing and identification.",
            "Poetry": "Manages project dependencies.",
            "Cybera": "Provides cloud infrastructure and services.",
            "Uvicorn": "Serves and deploys APIs for image recognition and user interactions.",
            "GitHub": "Handles version control, documentation, and task management.",
            "VuePress": "Used for creating a website with full project documentation."
        },
        "contributions": [
            "Documented work on GitHub and VuePress.",
            "Took meeting minutes and kept documentation.",
            "Designed use cases and user experiences.",
            "Developed image recognition with OpenCV and integrated it into the app.",
            "Optimized image processing.",
            "Designed and planned games and activities.",
            "Created game-related pages and control logic.",
            "Set up the admin page."
        ],
        "bestFeatures": "The app’s cross-platform compatibility is a highlight. It works well on various devices, including older phones, and is accessible on both Android and iOS. It’s all about making the app as inclusive as possible.",
        "rating": 4.2,
        "codeUrl": ""
    },
    "proquest": {
        "title": "ProQuest",
        "description": "ProQuest helps agents find the best teams and scouts find top players. Users can add players and teams, track performance, and test out different tactics in the planner. It’s all about showcasing talent and strategic planning.",
        "images": ["proquest1.png", "proquest2.png", "proquest3.png"],
        "videos": ["proquest.mp4"],
        "technologies": {
            "Visual Studio Code": "IDE for coding.",
            "Figma": "Used for wireframing, prototyping, and storyboarding.",
            "TailwindCSS": "A CSS framework for styling and design.",
            "Vite": "A build tool for setting up React projects.",
            "React": "JavaScript library for building user interfaces.",
            "Express": "Backend framework for Node.js.",
            "MongoDB": "NoSQL database for managing data.",
            "Javascript": "The programming language used.",
            "Node": "Runtime environment for executing JavaScript outside the browser.",
            "npm": "Package manager for Node.js.",
            "Render": "Cloud platform for serving and deploying APIs.",
            "Netlify": "Deploys frontend applications and manages web projects.",
            "GitHub": "Version control for source code, documentation, and task management."
        },
        "contributions": [
            "Solo"
        ],
        "bestFeatures": "I'm proud of several features: the multi-filtration system on the Players Page, dynamic CSS for different screen sizes, and the planner page where users can create and share their team setups. The planner page, in particular, offers a lot of fun and customization options.",
        "rating": 4.7,
        "codeUrl": "https://github.com/Byvalvin/proquest"
    },
    "pawnspath": {
        "title": "Pawn’s Path: An Endgame Forge",
        "description": "A tactical chess playground designed to help players hone their skills by focusing on endgame scenarios. Players can learn, practice, and play. The game is built with a minimalist style to focus on the strategy and decisions behind each move.",
        "images": ["pawnspath1.jpg"],
        "videos": [],
        "technologies": {
            "Unity": "Chess GUI and logic",
            "Python": "training RL/ML models for bots",
            "draw.io":"Creating sprites",
            "GitHub": "Used for version control and project management."
        },
        "contributions": [
            "Solo"
        ],
        "bestFeatures": "Pawn's Path focuses on endgame mastery with a variety of challenges, from defensive to offensive strategies. Key features include customizable endgame setups, the ability to challenge different types of bots, multiplayer support for competitive play, and the minimalist interface that keeps players focused on strategy. The endgame scenarios are highly diverse and cater to both beginner and advanced players.",
        "rating": 4.1,
        "codeUrl": "https://github.com/Byvalvin/Chess-Unity",
        "tryItOutLink": "./other/ChessUnity/ChessUnity.html"
    }

}
